----------------------------------------------------
-- 此文件由数据工具生成
-- 配置数据--guild_marketplace_data.xml
--------------------------------------

Config = Config or {} 
Config.GuildMarketplaceData = Config.GuildMarketplaceData or {}

-- -------------------const_start-------------------
Config.GuildMarketplaceData.data_const_length = 8
Config.GuildMarketplaceData.data_const = {
	["open_lev"] = {val=1, desc="宝库开启所需公会等级"},
	["guild_marketplace_sell_time"] = {val=20, desc="每个人每天能够售卖的次数"},
	["guild_marketplace_borad_num"] = {val=30, desc="公告保存的条数"},
	["guild_change_item_id"] = {val=36, desc="id"},
	["chat_Interval_time"] = {val=20, desc="action_1 间隔时间"},
	["change_action_time"] = {val=20, desc="action_1跳转action_2间隔时间"},
	["action_keep_time1"] = {val=20, desc="action_2保持时间"},
	["action_keep_time2"] = {val=20, desc="action_3保持时间"}
}
Config.GuildMarketplaceData.data_const_fun = function(key)
	local data=Config.GuildMarketplaceData.data_const[key]
	if DATA_DEBUG and data == nil then
		print('(Config.GuildMarketplaceData.data_const['..key..'])not found') return
	end
	return data
end
-- -------------------const_end---------------------


-- -------------------item_info_start-------------------
Config.GuildMarketplaceData.data_item_info_length = 56
Config.GuildMarketplaceData.data_item_info_cache = {}
Config.GuildMarketplaceData.data_item_info = function(key)
	if Config.GuildMarketplaceData.data_item_info_cache[key] == nil then
		local base = Config.GuildMarketplaceData.data_item_info_table[key]
		if not base then return end
		base = loadstring(string.format('return %s',base))()
		if not base then return end
		Config.GuildMarketplaceData.data_item_info_cache[key] = {
			id = base[1],
			name = base[2],
			price = base[3],
			sell = base[4],
			radio = base[5],
			type = base[6],
			is_sell = base[7],
			is_pile = base[8],
			max_pile = base[9],
			capacity = base[10],
			end_time = base[11],
			is_board = base[12],
			day_buy = base[13],
		}
	end
	return Config.GuildMarketplaceData.data_item_info_cache[key] 
end
Config.GuildMarketplaceData.data_item_info_table = {
	[10453] = [[{10453, "太阳符文", {{36,500}}, {}, 1, 3, 0, 0, 1, 15, 30, 1, 1}]],
	[37001] = [[{37001, "探宝券", {{36,3}}, {{36,1}}, 1, 2, 1, 1, 999, 15, 30, 1, 0}]],
	[10001] = [[{10001, "进阶石", {{36,5}}, {{36,1}}, 50, 2, 1, 1, 49950, 15, 30, 1, 0}]],
	[14001] = [[{14001, "先知水晶", {{36,150}}, {}, 1, 2, 0, 1, 999, 15, 30, 1, 2}]],
	[10403] = [[{10403, "高级召唤卷", {{36,20}}, {}, 1, 2, 0, 1, 999, 15, 30, 1, 10}]],
	[39047] = [[{39047, "随机符石礼包", {{36,244}}, {}, 1, 2, 0, 1, 999, 15, 30, 1, 0}]],
	[40410] = [[{40410, "魔灵战靴", {{36,125}}, {}, 1, 1, 0, 1, 999, 15, 30, 1, 0}]],
	[40409] = [[{40409, "光辉战靴", {{36,73}}, {{36,14}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}]],
	[40408] = [[{40408, "雷霆战靴", {{36,43}}, {{36,8}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}]],
	[40407] = [[{40407, "胜利战靴", {{36,25}}, {{36,5}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}]],
	[40406] = [[{40406, "荣耀战靴", {{36,15}}, {{36,3}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}]],
	[40405] = [[{40405, "冒险战靴", {{36,9}}, {{36,1}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}]],
	[40310] = [[{40310, "魔灵头盔", {{36,125}}, {}, 1, 1, 0, 1, 999, 15, 30, 1, 0}]],
	[40309] = [[{40309, "光辉头盔", {{36,73}}, {{36,14}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}]],
	[40308] = [[{40308, "雷霆头盔", {{36,43}}, {{36,8}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}]],
	[40307] = [[{40307, "胜利头盔", {{36,25}}, {{36,5}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}]],
	[40306] = [[{40306, "荣耀头盔", {{36,15}}, {{36,3}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}]],
	[40305] = [[{40305, "冒险头盔", {{36,9}}, {{36,1}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}]],
	[40210] = [[{40210, "魔灵护甲", {{36,125}}, {}, 1, 1, 0, 1, 999, 15, 30, 1, 0}]],
	[40209] = [[{40209, "光辉护甲", {{36,73}}, {{36,14}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}]],
	[40208] = [[{40208, "雷霆护甲", {{36,43}}, {{36,8}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}]],
	[40207] = [[{40207, "胜利护甲", {{36,25}}, {{36,5}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}]],
	[40206] = [[{40206, "荣耀护甲", {{36,15}}, {{36,3}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}]],
	[40205] = [[{40205, "冒险护甲", {{36,9}}, {{36,1}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}]],
	[40110] = [[{40110, "魔灵战刃", {{36,125}}, {}, 1, 1, 0, 1, 999, 15, 30, 1, 0}]],
	[40109] = [[{40109, "光辉战斧", {{36,73}}, {{36,14}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}]],
	[40108] = [[{40108, "雷霆战刃", {{36,43}}, {{36,8}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}]],
	[40107] = [[{40107, "胜利火炮", {{36,25}}, {{36,5}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}]],
	[40106] = [[{40106, "荣耀战刃", {{36,15}}, {{36,3}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}]],
	[40105] = [[{40105, "冒险之刃", {{36,9}}, {{36,1}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}]],
	[29905] = [[{29905, "5星随机碎片", {{36,10}}, {}, 1, 0, 0, 1, 999, 15, 30, 1, 0}]],
	[29305] = [[{29305, "5星风系碎片", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}]],
	[29205] = [[{29205, "5星火系碎片", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}]],
	[29105] = [[{29105, "5星水系碎片", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}]],
	[28904] = [[{28904, "阿努比斯碎片", {{36,800}}, {}, 50, 0, 0, 1, 49950, 15, 30, 1, 0}]],
	[27903] = [[{27903, "雷神碎片", {{36,800}}, {}, 50, 0, 0, 1, 49950, 15, 30, 1, 0}]],
	[26907] = [[{26907, "斯芬克斯碎片", {{36,12}}, {}, 1, 0, 0, 1, 999, 15, 30, 1, 0}]],
	[26906] = [[{26906, "潘碎片", {{36,750}}, {}, 50, 0, 0, 1, 49950, 15, 30, 1, 0}]],
	[26905] = [[{26905, "雅典娜碎片", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}]],
	[26904] = [[{26904, "美杜莎碎片", {{36,10}}, {{36,5}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}]],
	[26903] = [[{26903, "魅魔女王碎片", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}]],
	[26902] = [[{26902, "凯兰崔尔碎片", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}]],
	[26900] = [[{26900, "奥丁碎片", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}]],
	[25907] = [[{25907, "瓦尔基里碎片", {{36,750}}, {}, 50, 0, 0, 1, 49950, 15, 30, 1, 0}]],
	[25905] = [[{25905, "吸血伯爵碎片", {{36,10}}, {{36,5}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}]],
	[25904] = [[{25904, "阿波罗碎片", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}]],
	[25903] = [[{25903, "菲尼克斯碎片", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}]],
	[25902] = [[{25902, "剑豪卡赞碎片", {{36,10}}, {{36,5}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}]],
	[25901] = [[{25901, "炎魔之王碎片", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}]],
	[25900] = [[{25900, "炽天使碎片", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}]],
	[24909] = [[{24909, "耶梦加得碎片", {{36,750}}, {}, 50, 0, 0, 1, 49950, 15, 30, 1, 0}]],
	[24908] = [[{24908, "阿瑞斯碎片", {{36,10}}, {{36,5}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}]],
	[24907] = [[{24907, "海宁芙碎片", {{36,10}}, {{36,5}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}]],
	[24906] = [[{24906, "少年梅林碎片", {{36,10}}, {{36,5}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}]],
	[24905] = [[{24905, "派西斯碎片", {{36,10}}, {{36,5}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}]],
	[24902] = [[{24902, "冰霜巨龙碎片", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}]]
}
-- -------------------item_info_end---------------------


-- -------------------dic_item_info_start-------------------
Config.GuildMarketplaceData.data_dic_item_info_length = 56
Config.GuildMarketplaceData.data_dic_item_info = {
	[24902] = 1,
	[24905] = 1,
	[24906] = 1,
	[24907] = 1,
	[24908] = 1,
	[24909] = 0,
	[25900] = 1,
	[25901] = 1,
	[25902] = 1,
	[25903] = 1,
	[25904] = 1,
	[25905] = 1,
	[25907] = 0,
	[26900] = 1,
	[26902] = 1,
	[26903] = 1,
	[26904] = 1,
	[26905] = 1,
	[26906] = 0,
	[26907] = 0,
	[27903] = 0,
	[28904] = 0,
	[29105] = 1,
	[29205] = 1,
	[29305] = 1,
	[29905] = 0,
	[40105] = 1,
	[40106] = 1,
	[40107] = 1,
	[40108] = 1,
	[40109] = 1,
	[40110] = 0,
	[40205] = 1,
	[40206] = 1,
	[40207] = 1,
	[40208] = 1,
	[40209] = 1,
	[40210] = 0,
	[40305] = 1,
	[40306] = 1,
	[40307] = 1,
	[40308] = 1,
	[40309] = 1,
	[40310] = 0,
	[40405] = 1,
	[40406] = 1,
	[40407] = 1,
	[40408] = 1,
	[40409] = 1,
	[40410] = 0,
	[39047] = 0,
	[10403] = 0,
	[14001] = 0,
	[10001] = 1,
	[37001] = 1,
	[10453] = 0
}
Config.GuildMarketplaceData.data_dic_item_info_fun = function(key)
	local data=Config.GuildMarketplaceData.data_dic_item_info[key]
	if DATA_DEBUG and data == nil then
		print('(Config.GuildMarketplaceData.data_dic_item_info['..key..'])not found') return
	end
	return data
end
-- -------------------dic_item_info_end---------------------


-- -------------------explain_start-------------------
Config.GuildMarketplaceData.data_explain_length = 3
Config.GuildMarketplaceData.data_explain = {
	[1] = {id=1, title="基础规则", desc="1.公会宝库为仅限同一公会成员进行操作的特殊公共商店，同一公会成员可在商店内进行购买或放入操作从而完成物品的间接共享  \n2.公会宝库内的商品作为公会的公共财产绑定于公会，不同公会的公会宝库内的商品也不同"},
	[2] = {id=2, title="商品来源", desc="1.公会宝库的物品来源分为系统玩法产出和玩家自行放入两种        \n2.系统玩法产出：部分公会玩法会产出特殊的公会宝库奖励，这部分奖励物品不会直接放入玩家的背包，而是放入公会宝库中成为可供玩家兑换的商品。目前会发放该种奖励的玩法如下：\n<div fontcolor=#d95014>公会秘境\n公会战</div>\n3.玩家自行放入：公会宝库允许玩家放入特定的物品从而实现同一公会成员间物品的间接共享，每名玩家<div fontcolor=#d95014>每天</div>可以向宝库内放入<div fontcolor=#d95014>20</div>次物品。目前公会宝库允许放入的物品条目如下：\n<div fontcolor=#d95014>冰霜巨龙碎片　　　派西斯碎片\n少年梅林碎片　　　海宁芙碎片\n阿瑞斯碎片　　　　炽天使碎片\n炎魔之王碎片　　　剑豪卡赞碎片\n菲尼克斯碎片　　　阿波罗碎片\n吸血伯爵碎片　　　奥丁碎片\n凯兰崔尔碎片　　　魅魔女王碎片\n美杜莎碎片　　　　雅典娜碎片\n5星水系碎片　  　　5星火系碎片\n5星风系碎片　　  　冒险之刃\n荣耀战刃　　　　　胜利火炮\n雷霆战刃　　　　　光辉战斧\n冒险护甲　　　　　荣耀护甲\n胜利护甲　　　　　雷霆护甲\n光辉护甲　　　　　冒险头盔\n荣耀头盔　　　　　胜利头盔\n雷霆头盔　　　　　光辉头盔\n冒险战靴　　　　　荣耀战靴\n胜利战靴　　　　　雷霆战靴\n光辉战靴　　　　　进阶石\n探宝券</div>\n"},
	[3] = {id=3, title="系统回收与存储上限", desc="1.系统回收：宝库内的商品存在着<div fontcolor=#d95014>30</div>天的保存期限，达到保存期限后，对应的商品将会在次日的凌晨<div fontcolor=#d95014>5</div>点从公会宝库中移除  \n2.存储上限：宝库内不同种类的物品有着不同的存储上限，当某种物品的数量达到存储上限时，玩家将不能再向宝库内放入更多的该种物品"}
}
Config.GuildMarketplaceData.data_explain_fun = function(key)
	local data=Config.GuildMarketplaceData.data_explain[key]
	if DATA_DEBUG and data == nil then
		print('(Config.GuildMarketplaceData.data_explain['..key..'])not found') return
	end
	return data
end
-- -------------------explain_end---------------------


-- -------------------landlady_info_start-------------------
Config.GuildMarketplaceData.data_landlady_info_length = 3
Config.GuildMarketplaceData.data_landlady_info = {
	[1] = {{action_id=1, content="不是随便什么东西都有资格放进宝库的！", weight=100}, {action_id=1, content="看上心仪的宝物了？拿勇者凭证来换吧！", weight=100}, {action_id=1, content="宝库会定期进行整理，不买可就没咯~", weight=100}, {action_id=1, content="提醒你一下，放入物品是可以换取勇者凭证的", weight=100}},
	[2] = {{action_id=2, content="参加公会战可以获取勇者凭证，不去看看吗？", weight=100}},
	[3] = {{action_id=3, content=")", weight=100}, {action_id=3, content="我要生气咯！", weight=100}}
}
-- -------------------landlady_info_end---------------------
