----------------------------------------------------
-- 此文件由数据工具生成
-- 物品数据--item_data.xml
--------------------------------------

Config = Config or {} 
Config.ItemData8 = Config.ItemData8 or {}

-- -------------------unit_start-------------------
Config.ItemData8.data_unit_length = 78
Config.ItemData8.data_unit_cache = {}
Config.ItemData8.data_unit = function(key)
	if Config.ItemData8.data_unit_cache[key] == nil then
		local base = Config.ItemData8.data_unit_table[key]
		if not base then return end
		base = loadstring(string.format('return %s',base))()
		if not base then return end
		Config.ItemData8.data_unit_cache[key] = {
			id = base[1],
			name = base[2],
			icon = base[3],
			type = base[4],
			sub_type = base[5],
			quality = base[6],
			overlap = base[7],
			gain_type = base[8],
			use_type = base[9],
			expire_type = base[10],
			value = base[11],
			effect = base[12],
			client_effect = base[13],
			source = base[14],
			desc = base[15],
			lev = base[16],
			career = base[17],
			sex = base[18],
			ext = base[19],
			is_effect = base[20],
			eqm_jie = base[21],
			fast_use = base[22],
			tips_btn = base[23],
			type_desc = base[24],
			use_desc = base[25],
			can_share = base[26],
			use_count = base[27],
		}
	end
	return Config.ItemData8.data_unit_cache[key] 
end
Config.ItemData8.data_unit_table = {
	[100540] = [[{100540, "日记40", 100540, 35, 6, 0, 11, 5, 1, 0, {}, {{effect_type=40,val=100540}}, {}, {}, "有人住高楼，有人在深沟，有人光万丈，有人一身锈，世人万千种，浮云莫去求，斯人若彩虹，遇上方知有。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《彩虹》", 0, 0}]],
	[100539] = [[{100539, "日记39", 100539, 35, 6, 0, 10, 5, 1, 0, {}, {{effect_type=40,val=100539}}, {}, {}, "不要让别人告诉你，你不能做什么。只要有梦想，就要去追求。那些做不到的人总要告诉你，你也不行。想要什么就得去努力，去追求。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《追求》", 0, 0}]],
	[100538] = [[{100538, "日记38", 100538, 35, 6, 0, 9, 5, 1, 0, {}, {{effect_type=40,val=100538}}, {}, {}, "我们不能改变这个世界，但至少可以不被这个世界改变。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《改变》", 0, 0}]],
	[100537] = [[{100537, "日记37", 100537, 35, 6, 0, 8, 5, 1, 0, {}, {{effect_type=40,val=100537}}, {}, {}, "我们曾经仰望星空，思考我们在宇宙中的位置，而现在我们只会低着头，担心如何在这片土地上活下去。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《仰望》", 0, 0}]],
	[100536] = [[{100536, "日记36", 100536, 35, 6, 0, 7, 5, 1, 0, {}, {{effect_type=40,val=100536}}, {}, {}, "生活坏到一定程度就会好起来，因为它无法更坏。努力过后，才知道许多事情，坚持坚持。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《坚持》", 0, 0}]],
	[100535] = [[{100535, "日记35", 100535, 35, 6, 0, 6, 5, 1, 0, {}, {{effect_type=40,val=100535}}, {}, {}, "主人，你是想放手一搏，还是等到年华老去，心中充满遗憾，孤独地迈向黄泉路?", 0, 0, 2, {}, 0, 0, 0, {}, "", "《抉择》", 0, 0}]],
	[100534] = [[{100534, "日记34", 100534, 35, 6, 0, 5, 5, 1, 0, {}, {{effect_type=40,val=100534}}, {}, {}, "人生就像一盒巧克力，你永远不知道下一颗是什么味道。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《巧克力》", 0, 0}]],
	[100533] = [[{100533, "日记33", 100533, 35, 6, 0, 4, 5, 1, 0, {}, {{effect_type=40,val=100533}}, {}, {}, "主人，你一定要尽全力保护你的梦想，那些嘲笑你的人，他们必定会失败，他们想把你变成和他们一样的人。有梦想，就要努力去实现。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《梦想》", 0, 0}]],
	[100532] = [[{100532, "日记32", 100532, 35, 6, 0, 3, 5, 1, 0, {}, {{effect_type=40,val=100532}}, {}, {}, "主人你的人生故事开头也许充满坎坷，不过这并不影响你成为什么样的人。关键看你后来的人生路，你自己选择怎么走下去。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《坎坷》", 0, 0}]],
	[100531] = [[{100531, "日记31", 100531, 35, 6, 0, 2, 5, 1, 0, {}, {{effect_type=40,val=100531}}, {}, {}, "愿你被打击时，记起你的珍贵，抵抗恶意；愿你在迷茫时，坚信你的珍贵，爱你所爱，行你所行，听从你心，无问东西。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《无问东西》", 0, 0}]],
	[100530] = [[{100530, "日记30", 100530, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100530}}, {}, {}, "等到所有风景都看透，我会陪你看细水长流。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《细水长流》", 0, 0}]],
	[100529] = [[{100529, "日记29", 100529, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100529}}, {}, {}, "每个人心中总有一个太阳，你一直在我心中发着光。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《心中的太阳》", 0, 0}]],
	[100528] = [[{100528, "日记28", 100528, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100528}}, {}, {}, "我觉得你的未来肯定会很好，因为主人你的努力我一直都看在眼里。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《未来的模样》", 0, 0}]],
	[100527] = [[{100527, "日记27", 100527, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100527}}, {}, {}, "等待出来的是命运，拼搏出来的才是人生。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《命运与人生》", 0, 0}]],
	[100526] = [[{100526, "日记26", 100526, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100526}}, {}, {}, "当你认真起来的时候，全世界都会为你让出一条道路。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《认真》", 0, 0}]],
	[100525] = [[{100525, "日记25", 100525, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100525}}, {}, {}, "努力并不一定会成功，但那段努力的时光一定会让我们看到更好的自己。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《努力的时光》", 0, 0}]],
	[100524] = [[{100524, "日记24", 100524, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100524}}, {}, {}, "主人主人，我们都要努力呀，为了我们想要的生活。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《一起努力》", 0, 0}]],
	[100523] = [[{100523, "日记23", 100523, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100523}}, {}, {}, "时间是最不公平的东西，所有人每天都拥有着同时的时间，最后却活成了不同的模样。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《不公平的时间》", 0, 0}]],
	[100522] = [[{100522, "日记22", 100522, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100522}}, {}, {}, "时间是最公平的东西，对于所有人来说每天都只有24小时，不多不少，不偏不倚。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《公平的时间》", 0, 0}]],
	[100521] = [[{100521, "日记21", 100521, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100521}}, {}, {}, "我相信世界不会偏爱那些懒惰的人或者狗，也绝不会怠慢勤奋的那些。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《偏爱与怠慢》", 0, 0}]],
	[100520] = [[{100520, "日记20", 100520, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100520}}, {}, {}, "有时候我会想，我应该不会输的吧？因为我一直都想赢，只要我不认输，就不会输。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《输赢》", 0, 0}]],
	[100519] = [[{100519, "日记19", 100519, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100519}}, {}, {}, "人们不断地努力，都是为了强大到让世界无法改变自己，对吧？", 0, 0, 2, {}, 0, 0, 0, {}, "", "《努力的意义》", 0, 0}]],
	[100518] = [[{100518, "日记18", 100518, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100518}}, {}, {}, "我相信所有经历都不是没有意义，就像我每次摔跤也一定是为了让我以后更好地奔跑。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《经历》", 0, 0}]],
	[100517] = [[{100517, "日记17", 100517, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100517}}, {}, {}, "想要的东西，岁月都能给予。但如果不去努力，大概连岁月也会把你想要的东西忘记。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《想要的东西》", 0, 0}]],
	[100516] = [[{100516, "日记16", 100516, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100516}}, {}, {}, "偶尔想到你，我也会张口大笑，也许在别人看来我的样子一定很傻吧？但我也没办法。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《傻傻的狗》", 0, 0}]],
	[100515] = [[{100515, "日记15", 100515, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100515}}, {}, {}, "我还想趁年轻，多看看世界的风景。等我老一点，就一直待在你的身边，一直看着你。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《只有你》", 0, 0}]],
	[100514] = [[{100514, "日记14", 100514, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100514}}, {}, {}, "主人你看，这个世界真大，无边无际。但是当我遇到你之后，我的世界就只有你了。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《我的世界》", 0, 0}]],
	[100513] = [[{100513, "日记13", 100513, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100513}}, {}, {}, "有时候你说你想静一静，但我知道那会是你最需要我的时候。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《最需要的时候》", 0, 0}]],
	[100512] = [[{100512, "日记12", 100512, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100512}}, {}, {}, "旅途中见过了好多不开心的人，其实有水喝、有饭吃、难过时会有人陪伴，不就是值得开心的理由了吗？", 0, 0, 2, {}, 0, 0, 0, {}, "", "《开心的事情》", 0, 0}]],
	[100511] = [[{100511, "日记11", 100511, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100511}}, {}, {}, "人类好像说过“日有所思，夜有所梦”，那我每天经常会梦见你带着我出去玩算不算？", 0, 0, 2, {}, 0, 0, 0, {}, "", "《日思夜梦》", 0, 0}]],
	[100510] = [[{100510, "日记10", 100510, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100510}}, {}, {}, "一只狗出去旅行，我也会突然想找个人说说话。但，这个人不会是别人，就是你。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《想说说话》", 0, 0}]],
	[100509] = [[{100509, "日记9", 100509, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100509}}, {}, {}, "虽然我经常把家里弄得乱七八糟，让家里的家具换了一套又一套，但你不会怪我的对吧？我最亲爱的主人。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《我知道》", 0, 0}]],
	[100508] = [[{100508, "日记8", 100508, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100508}}, {}, {}, "我准备要回家啦。这一生即使我走得再远，见过再美的风景，都不及你身边的万分之一。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《最美的风景》", 0, 0}]],
	[100507] = [[{100507, "日记7", 100507, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100507}}, {}, {}, "时间真是一种神奇的魔法，能够让陆地变为海洋，山川化为平地，也能抚平一个人内心的创伤。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《时间的魔法》", 0, 0}]],
	[100506] = [[{100506, "日记6", 100506, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100506}}, {}, {}, "每次旅行时，背着你为我买的蓝色背包，就好像旅途永远有你在我的身旁。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《蓝色的背包》", 0, 0}]],
	[100505] = [[{100505, "日记5", 100505, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100505}}, {}, {}, "昨天在电视里看到一个人在雨中伤心痛苦，那也许是为了让雨水冲刷所有的悲伤吧？", 0, 0, 2, {}, 0, 0, 0, {}, "", "《悲伤》", 0, 0}]],
	[100504] = [[{100504, "日记4", 100504, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100504}}, {}, {}, "人生正如一颗种子，在阳光雨露到来时它就会生根发芽，茁壮成长，过程难免狂风暴雨，但终会雨过天晴。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《人生》", 0, 0}]],
	[100503] = [[{100503, "日记3", 100503, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100503}}, {}, {}, "春去秋来，四季变换，有些东西一直在变，而有些东西永远不变，比如我会一直在你身边。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《不变的东西》", 0, 0}]],
	[100502] = [[{100502, "日记2", 100502, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100502}}, {}, {}, "火车要经过的站点早已固定，而人生不是，它不断地去往未知的未来，也不会留下什么给现在。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《未来和现在》", 0, 0}]],
	[100501] = [[{100501, "日记1", 100501, 35, 6, 0, 1, 5, 1, 0, {}, {{effect_type=40,val=100501}}, {}, {}, "旅行的时候我也会像在家一样趴在窗台上，看楼下人来人往 。但是，少了你在身旁，再美好的景色都会有点缺憾。", 0, 0, 2, {}, 0, 0, 0, {}, "", "《旅行的缺憾》", 0, 0}]],
	[100405] = [[{100405, "洞穴", 100405, 34, 6, 3, 1, 5, 1, 0, {}, {{effect_type=39,val=100405}}, {}, {}, "", 0, 0, 2, {}, 0, 0, 0, {}, "", "", 0, 0}]],
	[100404] = [[{100404, "沙漠", 100404, 34, 6, 3, 1, 5, 1, 0, {}, {{effect_type=39,val=100404}}, {}, {}, "", 0, 0, 2, {}, 0, 0, 0, {}, "", "", 0, 0}]],
	[100403] = [[{100403, "街道", 100403, 34, 6, 2, 1, 5, 1, 0, {}, {{effect_type=39,val=100403}}, {}, {}, "", 0, 0, 2, {}, 0, 0, 0, {}, "", "", 0, 0}]],
	[100402] = [[{100402, "秋景", 100402, 34, 6, 2, 1, 5, 1, 0, {}, {{effect_type=39,val=100402}}, {}, {}, "", 0, 0, 2, {}, 0, 0, 0, {}, "", "", 0, 0}]],
	[100401] = [[{100401, "橱窗", 100401, 34, 6, 1, 1, 5, 1, 0, {}, {{effect_type=39,val=100401}}, {}, {}, "", 0, 0, 2, {}, 0, 0, 0, {}, "", "", 0, 0}]],
	[100312] = [[{100312, "瓷胎竹编", 100312, 33, 6, 5, 99, 7, 2, 0, {{31,600}}, {}, {}, {}, "独特的传统手工艺品，起源于清代中叶，当时主要用做贡品。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[产地：成都市]", 0, 0}]],
	[100311] = [[{100311, "贝雕画", 100311, 33, 6, 5, 99, 7, 2, 0, {{31,600}}, {}, {}, {}, "贝雕，中国工艺美术百花园中的珍品。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[产地：北海市]", 0, 0}]],
	[100310] = [[{100310, "常州梳篦", 100310, 33, 6, 5, 99, 7, 2, 0, {{31,600}}, {}, {}, {}, "梳篦，又称栉，中国古代八大发饰之一。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[产地：常州市]", 0, 0}]],
	[100309] = [[{100309, "洛阳宫灯", 100309, 33, 6, 5, 99, 7, 2, 0, {{31,600}}, {}, {}, {}, "元宵佳节常见的装饰品，品种繁多，具有浓厚的地方特色。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[产地：洛阳市]", 0, 0}]],
	[100308] = [[{100308, "玉屏箫笛", 100308, 33, 6, 5, 99, 7, 2, 0, {{31,600}}, {}, {}, {}, "其音色优美圆滑，做工精湛细腻，是民族乐器中的精品。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[产地：贵阳市]", 0, 0}]],
	[100307] = [[{100307, "酒泉夜光杯", 100307, 33, 6, 5, 99, 7, 2, 0, {{31,600}}, {}, {}, {}, "美酒置于杯中放在月光下，杯中闪闪发亮，夜光杯由此得名。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[产地：酒泉市]", 0, 0}]],
	[100306] = [[{100306, "香水", 100306, 33, 6, 5, 99, 7, 2, 0, {{31,600}}, {}, {}, {}, "具有芬芳浓郁的香气，以法国出产的最为有名。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[产地：法国]", 0, 0}]],
	[100305] = [[{100305, "巧克力", 100305, 33, 6, 5, 99, 7, 2, 0, {{31,600}}, {}, {}, {}, "主要原料为可可，常被用于情侣间表达爱意。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[产地：比利时]", 0, 0}]],
	[100304] = [[{100304, "银币", 100304, 33, 6, 5, 99, 7, 2, 0, {{31,600}}, {}, {}, {}, "银质的硬币，具有极高的收藏价值。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[产地：梵蒂冈]", 0, 0}]],
	[100303] = [[{100303, "威士忌", 100303, 33, 6, 5, 99, 7, 2, 0, {{31,600}}, {}, {}, {}, "由大麦等谷物酿制的烈性蒸馏酒，被称为“生命之水”。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[产地：苏格兰]", 0, 0}]],
	[100302] = [[{100302, "泰国榴莲", 100302, 33, 6, 5, 99, 7, 2, 0, {{31,600}}, {}, {}, {}, "产自泰国的金枕榴莲，具有“水果之王”的美称。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[产地：泰国]", 0, 0}]],
	[100301] = [[{100301, "和服", 100301, 33, 6, 5, 99, 7, 2, 0, {{31,600}}, {}, {}, {}, "具有日本特色的和式礼服，是日本引以为傲的文化遗产。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[产地：日本]", 0, 0}]],
	[100283] = [[{100283, "车票", 100283, 31, 6, 3, 99, 7, 2, 0, {}, {{effect_type=37,val={{301,200},{401,200},{501,200},{601,200},{701,200},{801,200}}}}, {}, {}, "一张可以通往邻近地区的紫色车票。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[概率前往温馨小区]", 0, 1}]],
	[100282] = [[{100282, "蓝色机票", 100282, 31, 6, 4, 99, 7, 2, 0, {}, {{effect_type=37,val={{303,200},{403,200},{503,200},{603,200},{703,200},{803,200}}}}, {}, {}, "一张蓝色的机票，隐约散发出神秘的气息。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[概率前往星空之境]", 0, 1}]],
	[100281] = [[{100281, "黄色机票", 100281, 31, 6, 4, 99, 7, 2, 0, {}, {{effect_type=37,val={{302,200},{402,200},{502,200},{602,200},{702,200},{802,200}}}}, {}, {}, "一张黄色的机票，外观华丽尊贵。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[概率前往贵族皇室]", 0, 1}]],
	[100245] = [[{100245, "精密的探测仪", 100245, 31, 6, 2, 99, 7, 2, 0, {}, {{effect_type=36,val={{2,100},{3,100}}}}, {}, {}, "对金币和钻石有着极为特殊的感应能力的探测器。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[金币钻石概率+10%]", 0, 1}]],
	[100244] = [[{100244, "智能相机", 100244, 31, 6, 2, 99, 7, 2, 0, {}, {{effect_type=36,val={{6,50}}}}, {}, {}, "成像质量极高的相机，可以随时记录下美好的事物。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[明信片概率+5%]", 0, 1}]],
	[100243] = [[{100243, "贵重的钢笔", 100243, 31, 6, 2, 99, 7, 2, 0, {}, {{effect_type=36,val={{7,50}}}}, {}, {}, "外出旅行写日记的必备之物，钢笔更贵重哦~", 0, 0, 2, {}, 0, 0, 0, {}, "", "[日记概率+5%]", 0, 1}]],
	[100242] = [[{100242, "水晶瓶", 100242, 31, 6, 2, 99, 7, 2, 0, {}, {{effect_type=36,val={{10,100}}}}, {}, {}, "透明的水晶瓶散发出炫目的光彩，里面一定装着什么宝物。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[符文精华概率+10%]", 0, 1}]],
	[100241] = [[{100241, "宝箱", 100241, 31, 6, 2, 99, 7, 2, 0, {}, {{effect_type=36,val={{9,100}}}}, {}, {}, "大大的宝箱，打开之后可能有意想不到的惊喜。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[英雄碎片概率+10%]", 0, 1}]],
	[100205] = [[{100205, "手持式探测器", 100205, 31, 6, 1, 99, 7, 2, 0, {}, {{effect_type=36,val={{2,50},{3,50}}}}, {}, {}, "对金币和钻石有着特殊感应能力的探测器。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[金币、钻石概率+5%]", 0, 1}]],
	[100204] = [[{100204, "傻瓜机", 100204, 31, 6, 1, 99, 7, 2, 0, {}, {{effect_type=36,val={{6,20}}}}, {}, {}, "可以记录下旅行中所见的美好事物。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[明信片概率+2%]", 0, 1}]],
	[100203] = [[{100203, "毛笔", 100203, 31, 6, 1, 99, 7, 2, 0, {}, {{effect_type=36,val={{7,20}}}}, {}, {}, "外出旅行写日记的耐用毛笔哦~", 0, 0, 2, {}, 0, 0, 0, {}, "", "[日记概率+2%]", 0, 1}]],
	[100202] = [[{100202, "玻璃瓶", 100202, 31, 6, 1, 99, 7, 2, 0, {}, {{effect_type=36,val={{10,50}}}}, {}, {}, "透明的玻璃瓶里面装着闪闪发光的东西。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[符文精华概率+5%]", 0, 1}]],
	[100201] = [[{100201, "小礼盒", 100201, 31, 6, 1, 99, 7, 2, 0, {}, {{effect_type=36,val={{9,50}}}}, {}, {}, "小小的礼盒，打开后可能有意想不到的惊喜。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[英雄碎片概率+5%]", 0, 1}]],
	[100108] = [[{100108, "豪华寿司组", 100108, 32, 6, 4, 99, 7, 2, 0, {}, {{effect_type=38,val={801,802,803,804,805}}}, {}, {}, "多种寿司组合而成，营养价值极高。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[适合超远地区旅行]", 0, 1}]],
	[100107] = [[{100107, "披萨", 100107, 32, 6, 4, 99, 7, 2, 0, {}, {{effect_type=38,val={701,702,703,704,705}}}, {}, {}, "多种酱汁和馅料制成的意大利食物，萌宠极为喜爱的食物。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[适合超远地区旅行]", 0, 1}]],
	[100106] = [[{100106, "汉堡", 100106, 32, 6, 3, 99, 7, 2, 0, {}, {{effect_type=38,val={601,602,603,604,605}}}, {}, {}, "面包蔬菜和牛肉饼夹制而成，营养价值高。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[适合长途旅行]", 0, 1}]],
	[100105] = [[{100105, "三明治", 100105, 32, 6, 3, 99, 7, 2, 0, {}, {{effect_type=38,val={501,502,503,504,505}}}, {}, {}, "面包肉片和奶酪夹制而成，营养价值较高。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[适合长途旅行]", 0, 1}]],
	[100104] = [[{100104, "法式面包", 100104, 32, 6, 2, 99, 7, 2, 0, {}, {{effect_type=38,val={401,402,403,404,405}}}, {}, {}, "因长条状而被戏称为“法棍”，是萌宠们较为喜爱的食物。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[适合中程旅行]", 0, 1}]],
	[100103] = [[{100103, "蛋糕", 100103, 32, 6, 2, 99, 7, 2, 0, {}, {{effect_type=38,val={301,302,303,304,305}}}, {}, {}, "古老的西式甜点，口感松软，营养价值较高。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[适合中程旅行]", 0, 1}]],
	[100102] = [[{100102, "饭团", 100102, 32, 6, 1, 99, 7, 2, 0, {}, {{effect_type=38,val={201,202,203}}}, {}, {}, "纯米饭制成的食物，容易携带，能满足生存需求。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[适合短途旅行]", 0, 1}]],
	[100101] = [[{100101, "压缩饼干", 100101, 32, 6, 1, 99, 7, 2, 0, {}, {{effect_type=38,val={101,102,103}}}, {}, {}, "轻便易携的粮食，吃后容易产生饱腹感。", 0, 0, 2, {}, 0, 0, 0, {}, "", "[适合短途旅行]", 0, 1}]]
}
-- -------------------unit_end---------------------
